<?php
	/*
	8.
	Объедините две ранее написанные функции в одну, которая получает строку на
	русском языке, производит транслитерацию и замену пробелов на
	подчеркивания (аналогичная задача решается при конструировании url-адресов
	на основе названия статьи в блогах).
	*/

	function url($str) {
		$str_buffer = mb_strtolower($str, "utf-8");
		$letters = array(
			'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'e',
			'ж' => 'j',	'з' => 'z', 'и' => 'i', 'й' => 'i', 'к' => 'k', 'л' => 'l', 'м' => 'm',
			'н' => 'n', 'о' => 'o',	'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'y',
			'ф' => 'f', 'х' => 'h', 'ц' => 'c',	'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sh', 'ъ' => '\'',
			'ы' => 'i', 'ь' => '\'', 'э' => 'e', 'ю' => 'yu', 'я' => 'ya',
		);
		$str_translit = strtr($str_buffer, $letters);

		$a = explode(' ', $str_translit);
		return implode('_', $a);
	}

	echo url('Привет мир');
