<?php
	/*
	6.
	Выведите на экран любое четверостишие. Пример:
	”Я помню чудное мгновенье:
	Передо мной явилась ты,
	Как мимолетное виденье,
	Как гений чистой красоты.”
	А.С. Пушкин
	Для каждой новой строки используйте отдельный оператор echo. Каждая строчка
	должна быть отдельной строковой переменной. Также необходимо использовать
	переводы строки. После четверостишия поставьте инициалы автора и выделите
	их курсивом.
	*/

	$str1 = "\"Я помню чудное мгновенье:<br>";
	$str2 = 'Передо мной явилась ты,<br>';
	$str3 = 'Как мимолетное виденье,<br>';
	$str4 = 'Как гений чистой красоты."<br>';
	$str5 = '<i>А.С. Пушкин<i>';

	echo $str1;
	echo $str2;
	echo $str3;
	echo $str4;
	echo $str5;
