<?php
	/*
	4.
	Выведите в восьмеричной системе числа от 10 до 20 (echo 010; echo 011;
	echo 012; ... echo 019; echo 020;) Объясните результат.
	*/

	echo "010 = " . 010 . "<br>";
	echo "011 = " . 011 . "<br>";
	echo "012 = " . 012 . "<br>";
	echo "013 = " . 013 . "<br>";
	echo "014 = " . 014 . "<br>";
	echo "015 = " . 015 . "<br>";
	echo "016 = " . 016 . "<br>";
	echo "017 = " . 017 . "<br>";
	echo "018 = " . 018 . " | 0181 = " . 0181 . "<br>";
	echo "019 = " . 019 . "<br>";
	echo "020 = " . 020 . "<br><br>";

	echo "057 = " . 057 . "<br>";
	echo "57<sub>8</sub> =
		5 * 8<sup>1</sup> + 7 * 8<sup>0</sup> =
		40 + 7 = 47<br>";
	echo "57<sub>8</sub> =
		101111<sub>2</sub> =
		1 * 2<sup>5</sup> + 0 * 2<sup>4</sup> + 1 * 2<sup>3</sup> +
		1 * 2<sup>2</sup> + 1 * 2<sup>1</sup> + 1 * 2<sup>0</sup> =
		32 + 0 + 8 + 4 + 2 + 1 = 47<br>";
